tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "odin-lang/homebrew-odin"

brew "go"
brew "rust"
brew "zig"
brew "odin"
brew "neovim"
brew "ghostty"

brew "lua-language-server"
brew "gopls"
brew "rust-analyzer"
brew "zls"
brew "typescript-language-server"
brew "eslint"
brew "prettier"

brew "fzf"
brew "ripgrep"
brew "fd"
brew "starship"
brew "direnv"
brew "zsh"

cask "google-chrome"
cask "rectangle"
cask "font-jetbrains-mono"
cask "raycast"
cask "stats"
cask "1password"
cask "spotify"

